
<?php
            /*****************************************************
                        データベース
            ******************************************************/

            /****************************************************
                【自分用】
                * データベース名：*******
                * ユーザー名：*******
                * パスワード：*********
            ***************************************************/

            /**********************　DB接続設定(毎回)*******************/
            $dsn = 'mysql:dbname=********;host=localhost';
            $user = '*********';
            $password = '*********';
            $pdo = new PDO($dsn, $user, $password, array(PDO::ATTR_ERRMODE => PDO::ERRMODE_WARNING));
        /**************************************************** */
    /*******************テーブルの作成*********************** */
    $sql = "CREATE TABLE IF NOT EXISTS Massege"
    ." ("
    . "id INT AUTO_INCREMENT PRIMARY KEY,"
    . "name char(32),"
    . "comment TEXT,"
    . "date TEXT,"
    . "password char(32)"
    .");";
    $stmt = $pdo->query($sql);
    /****************************************************** */
?>